%% Part 1 Δημιουργήστε το σήμα

close all; % κλείστε όλες τις γραφικές παραστάσεις
clear all; % καθαρίστε τον χώρο εργασίας
clc; % καθαρίστε το παράθυρο εντολών

Fs=2000; % συχνότητα δειγματοληψίας 2000 Hz
Ts=1/Fs; % περίοδος δειγματοληψίας
L=2000; % μήκος σήματος (αριθμός δειγμάτων)
T=L*Ts; % διάρκεια σήματος
t=0:Ts:(L-1)*Ts; % χρονικές στιγμές υπολογισμού το σήματος

x=sin(2*pi*100*t)...         % ημιτονικό σήμα συχνότητας 100 Hz
+ 0.3*sin(2*pi*150*(t-2))... % συνιστώσα 150 Hz
+ sin(2*pi*200*t);           % συνιστώσα 200 Hz

%% Σχεδιάστε το σήμα στο πεδίο του χρόνου

figure(1) % άνοιγμα παραθύρου για γραφική παράσταση
plot(t,x) % γραφική παράσταση του σήματος
title('Time domain plot of x') % τίτλος γραφικής παράστασης
xlabel('t (sec)') % λεζάντα στον άξονα x
ylabel('Amplitude') % λεζάντα στον άξονα y
pause % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε
axis([0 0.3 -2 2]) % εμφάνιση του σήματος από 0 έως 0.3 sec και
                   % κλίμακα από -2 έως 2

pause % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

%%  Υπολογίστε τον διακριτό μετασχηματισμό Fourier

N = 2^nextpow2(L); % μήκος μετασχηματισμού Fourier.
% η nextpow2 βρίσκει τον εκθέτη της δύναμης του 2 που
% είναι μεγαλύτερη ή ίση από το όρισμα L
% εναλλακτικά, =ceil(log2(L))

Fo=Fs/N; % ανάλυση συχνότητας
f=(0:N-1)*Fo; % διάνυσμα συχνοτήτων
X=fft(x,N); % αριθμητικός υπολογισμός του διακριτού μετασχηματισμού
            % Fourier (DFT) για Ν σημεία
       
%% Σχεδιάστε το σήμα στο πεδίο συχνότητας

% Αφού το σήμα είναι πραγματικό μπορείτε
% να σχεδιάσετε μόνο τις θετικές συχνότητες

figure(2) % άνοιγμα παραθύρου για γραφική παράστα-ση
plot(f(1:300),abs(X(1:300))) % γραφική παράσταση των θετικών συχνοτήτων
title('Frequency domain plot of x') % τίτλος γραφικής παράστασης
xlabel('f (Hz)') % λεζάντα στον άξονα x
ylabel('Amplitude') % λεζάντα στον άξονα y
pause % αναμονή για να δείτε το σχήμα, πιέστε ένα πλήκτρο για να συνεχίσετε

% για τη γραφική παράσταση του αμφίπλευρου φάσματος
% πρέπει να χρησιμοποιήσετε την fftshift ώστε ο όρος για
% τη συχνότητα μηδέν να μετακινηθεί στην αρχή των αξόνων
% δείτε help fftshift για περισσότερες λεπτομέρειες

figure(3) % άνοιγμα παραθύρου για γραφική παράσταση
f=f-Fs/2; % ολίσθηση συχνοτήτων προς τα αριστερά κατά –Fs/2
X=fftshift(X); % ολίσθηση της μηδενικής συχνότητας στο κέντρο
               % του φάσματος

% (ακολουθούν πολλές εντολές σε μια γραμμή)
plot(f,abs(X));title('Two sided spectrum of x'); xlabel('f (Hz)');
ylabel('Amplitude')
pause % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

%% Υπολογίστε την ισχύ

power=X.*conj(X)/N/L; % υπολογισμός πυκνότητας ισχύος

figure(4) % άνοιγμα παραθύρου για γραφική παράσταση
plot(f,power) % ισχύς ανά συνιστώσα συχνότητα
xlabel('Frequency (Hz)') % λεζάντα στον άξονα x
ylabel('Power') % λεζάντα στον άξονα y
title('{\bf Periodogram}') % τίτλος διαγράμματος με παχιά γράμματα
pause

disp('Part2')

%% Part 2 Προσθέστε θόρυβο στο σήμα
% Συμπληρώστε τον κώδικα για τη δημιουργία του σήματος θορύβου n με τη
% βοήθεια της συνάρτησης randn.
% Το διάνυσμα θορύβου n θα πρέπει να είναι του ίδιου μεγέθους με αυτό της
% ημιτονοειδούς κυματομορφής x του πρώτου μέρους. Δείτε help size.
% Σχεδιάστε το σήμα θορύβου στο διάστημα από 0 έως 0.3 sec και κλίμακα
% από -2 έως 2
% Υπολογίστε το περιοδόγραμμα του n και σχεδιάστε την πυκνότητα φάσματος
% ισχύος του σήματος θορύβου.
% Προσθέστε το σήμα θορύβου και το x για να λάβετε το σήμα με θόρυβο s.
% Σχεδιάσατε το σήμα με θόρυβο s στο πεδίο του χρόνου στην περιοχή 0 έως
% 0.2 sec και κλίμακα από -2 έως 2 καθώς και το αμφίπλευρο φάσμα του
%% Δημιουργία και σχεδιασμός σήματος θορύβου
noise_sz=size(x);
n=randn(noise_sz);

figure(5) % άνοιγμα παραθύρου για γραφική παράσταση
plot(t,n) % γραφική παράσταση του σήματος
title('Time domain plot of Noise') % τίτλος γραφικής παράστασης
xlabel('t (sec)') % λεζάντα στον άξονα x
ylabel('Amplitude') % λεζάντα στον άξονα y
axis([0 0.3 -2 2]) % εμφάνιση του σήματος από 0 έως 0.3 sec και
                   % κλίμακα από -2 έως 2

pause % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

%% Υπολογισμός περιοδογράμματος και πυκνότητας φάσματος ισχύος θορύβου
Noise=fft(n,N); % υπολογισμός DFT του θορύβου
power_of_n=Noise.*conj(Noise)/N/L; % υπολογισμός πυκνότητας ισχύος
f=f+Fs/2; % ολίσθηση συχνοτήτων προς τα δεξιά κατά Fs/2

figure(6) % άνοιγμα παραθύρου για γραφική παράσταση
plot(f,power_of_n) % ισχύς ανά συνιστώσα συχνότητα
xlabel('Frequency (Hz)') % λεζάντα στον άξονα x
ylabel('Power') % λεζάντα στον άξονα y
title('{\bf Periodogram}') % τίτλος διαγράμματος με παχιά γράμματα
pause

%% Προσθήκη θορύβου n στο σήμα x και σχεδιασμός του νέου σήματος
s=x+n;

figure(7) % άνοιγμα παραθύρου για γραφική παράσταση

plot(t,s) % γραφική παράσταση του σήματος
title('Time domain plot of Noised x') % τίτλος γραφικής παράστασης
xlabel('t (sec)') % λεζάντα στον άξονα x
ylabel('Amplitude') % λεζάντα στον άξονα y
axis([0 0.2 -2 2]) % εμφάνιση του σήματος από 0 έως 0.2 sec και
                   % κλίμακα από -2 έως 2
pause

S=fft(s,N);
f=f-Fs/2; % ολίσθηση συχνοτήτων προς τα αριστερά κατά –Fs/2
S=fftshift(S); % ολίσθηση της μηδενικής συχνότητας στο κέντρο
               % του φάσματος

figure(8)             

plot(f,abs(S));
title('Two sided spectrum of Noised x'); 
xlabel('f (Hz)');
ylabel('Amplitude');
pause % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

disp('Part3')

%% Part 3 Πολλαπλασιασμός Σημάτων
% Συμπληρώστε τον κώδικα δημιουργίας ενός ημιτονοειδούς σήματος συχνότητας
% 750 Hz και πολλαπλασιάστε με το προηγούμενο σήμα s.
% Τα δύο σήματα θα πρέπει να είναι του ίδιου μεγέθους και να χρησιμοποιηθεί
% ο τελεστής '.*' για ανά στοιχείο πολλαπλασιασμό.
% Σχεδιάστε το αποτέλεσμα στο πεδίο του χρόνου στην περιοχή 0 έως 0.2 sec
% και κλίμακα από -2 έως 2 καθώς και στο πεδίο της συχνότητας
% χρησιμοποιώντας τη συνάρτηση fftshift.
%% Δημιουργία ημιτονοειδούς συχνότητας 750Hz

%ίδιες προδιαγραφές δειγματοληψίας και μήκους σήματος
x_new=sin(2*pi*750*t); % ημιτονικό σήμα συχνότητας 750 Hz

%% Πολλαπλασιασμός x_new και s
x_new=x_new.*s;

%% Σχεδιασμός
figure(9) % άνοιγμα παραθύρου για γραφική παράσταση
plot(t,x_new) % γραφική παράσταση του σήματος
title('Time domain plot of New Signal') % τίτλος γραφικής παράστασης
xlabel('t (sec)') % λεζάντα στον άξονα x
ylabel('Amplitude') % λεζάντα στον άξονα y
axis([0 0.2 -2 2]) % εμφάνιση του σήματος από 0 έως 0.2 sec και
                   % κλίμακα από -2 έως 2

pause % αναμονή, πιέστε ένα πλήκτρο για να συνεχίσετε

X_new=fft(x_new,N);
X_new=fftshift(X_new);
figure(10)             

plot(f(1000:2000),abs(X_new(1000:2000)));
title('Frequency domain plot of New Signal'); 
xlabel('f (Hz)');
ylabel('Amplitude');